Public Attributes | List of all members
API_ExternalElemType Struct Reference
Element Manager API
A struct containing the header and data of an external element type (see API_AnalyticalLinkType). More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header. The typeID should be API_ExternalElemType.
char  | externalElemData [API_ExternalElemDataSize]
Serialized data identifying the element.
Detailed Description
A struct containing the header and data of an external element type (see API_AnalyticalLinkType).
Since
Archicad 26
Remarks
In version 26 the Analytical element types were replaced by the externalElem member. The former structures (e.g. API_AnalyticalLinkType) can be obtained by the appropriate functions (e.g. ACAPI_Analytical_GetLinkFromElement).
Member Data Documentation
◆ externalElemData
 API_ExternalElemType::externalElemData
Serialized data identifying the element.
◆ head
 API_ExternalElemType::head
General element header. The typeID should be API_ExternalElemType.